stm32duino/Arduino_Core_STM32/system/Drivers/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_sdio.c
  *** SDIO card Function basic register (FBR) ***
  ===========================
  [..]
    (+) The SDIO card function basic register are used to allow the host to quickly determine the abilities and
        requirements of each function.
    (+) To get the SDIO function basic register information, you can use the API HAL_SDIO_GetCardFBRRegister().

  *** SDIO HAL driver macros list ***
  ==================================
  [..]
    Below the list of most used macros in SDIO HAL driver.

    (+) __HAL_SDIO_ENABLE_IT: Enable the SDIO device interrupt
    (+) __HAL_SDIO_DISABLE_IT: Disable the SDIO device interrupt
    (+) __HAL_SDIO_GET_FLAG: Check whether the specified SDIO flag is set or not
    (+) __HAL_SDIO_CLEAR_FLAG: Clear the SDIO's pending flags
    (+) __HAL_SDIO_GET_IT: Check whether the specified SDIO interrupt has occurred or not
    (+) __HAL_SDIO_GET_IT_SOURCE: Checks whether the specified SDIO interrupt is enabled or not

    (@) You can refer to the SDIO HAL driver header file for more useful macros

  *** Callback registration ***
  =============================================
  [..]
    The compilation define USE_HAL_SDIO_REGISTER_CALLBACKS when set to 1
    allows the user to configure dynamically the driver callbacks.

    Use Functions HAL_SDIO_RegisterCallback() to register a user callback,
    it allows to register following callbacks:
      (+) TxCpltCallback : callback when a transmission transfer is completed.
      (+) RxCpltCallback : callback when a reception transfer is completed.
      (+) ErrorCallback : callback when error occurs.
      (+) MspInitCallback    : SDIO MspInit.
      (+) MspDeInitCallback  : SDIO MspDeInit.
    This function takes as parameters the HAL peripheral handle, the Callback ID
    and a pointer to the user callback function.
    For specific callbacks TransceiverCallback use dedicated register callbacks:
    respectively HAL_SDIO_RegisterTransceiverCallback().

    Use function HAL_SDIO_UnRegisterCallback() to reset a callback to the default
    weak (overridden) function. It allows to reset following callbacks:
      (+) TxCpltCallback : callback when a transmission transfer is completed.
      (+) RxCpltCallback : callback when a reception transfer is completed.
      (+) ErrorCallback : callback when error occurs.
      (+) MspInitCallback    : SDIO MspInit.
      (+) MspDeInitCallback  : SDIO MspDeInit.
    This function) takes as parameters the HAL peripheral handle and the Callback ID.
    For specific callbacks TransceiverCallback use dedicated unregister callbacks:
    respectively HAL_SDIO_UnRegisterTransceiverCallback().

    By default, after the HAL_SDIO_Init and if the state is HAL_SDIO_STATE_RESET
    all callbacks are reset to the corresponding legacy weak (overridden) functions.
    Exception done for MspInit and MspDeInit callbacks that are respectively
    reset to the legacy weak (overridden) functions in the HAL_SDIO_Init
    and HAL_SDIO_DeInit only when these callbacks are null (not registered beforehand).
    If not, MspInit or MspDeInit are not null, the HAL_SDIO_Init and HAL_SDIO_DeInit
    keep and use the user MspInit/MspDeInit callbacks (registered beforehand)

    Callbacks can be registered/unregistered in READY state only.
    Exception done for MspInit/MspDeInit callbacks that can be registered/unregistered
    in READY or RESET state, thus registered (user) MspInit/DeInit callbacks can be used
    during the Init/DeInit.
    In that case first register the MspInit/MspDeInit user callbacks
    using HAL_SDIO_RegisterCallback before calling HAL_SDIO_DeInit
    or HAL_SDIO_Init function.

    When The compilation define USE_HAL_SDIO_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registering feature is not available
    and weak (overridden) callbacks are used.

  *** SDIO peripheral IO interrupt ***
  =============================================
  [..]
  (+) Below the list of most used SDIO function to check and control the IO card's enable and interrupts on a per
      functions basis.

    (+) HAL_SDIO_EnableIOFunctionInterrupt: Enable SDIO IO interrupt.
    (+) HAL_SDIO_DisableIOFunctionInterrupt: Disable SDIO IO interrupt.
    (+) HAL_SDIO_EnableIOFunction: Enable Function number(0-7)
    (+) HAL_SDIO_DisableIOFunction: Disable Function number(0-7)
    (+) HAL_SDIO_SelectIOFunction: Select a function number(0-7)
    (+) HAL_SDIO_AbortIOFunction: Abort an IO read or write operation and free the SDIO bus.
    (+) HAL_SDIO_EnableIOAsynInterrupt: Enable Bit of asynchronous interrupt
    (+) HAL_SDIO_DisableIOAsynInterrupt: Disable Bit of asynchronous interrupt

  @endverbatim
  ******************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

/** @addtogroup STM32H5xx_HAL_Driver
  * @{
  */

/** @addtogroup SDIO
  * @{
  */
#if defined (SDMMC1) || defined (SDMMC2)
#ifdef HAL_SDIO_MODULE_ENABLED

/* Private define ----------------------------------------------------------------------------------------------------*/
/** @addtogroup SDIO_Private_Defines
  * @{
  */
#define SDIO_INIT_FREQ         400000U /*!< Initialization phase : 400 kHz max */
#define SDIO_TIMEOUT           1000U   /*!< SDIO timeout millisecond           */

#define SDIO_FUNCTION_0        0x00U   /*!< SDIO_Functions 0                   */
#define SDIO_FUNCTION_1        0x01U   /*!< SDIO_Functions 1                   */

#define SDIO_READ              0x0U    /*!< Read flag for cmd52 and cmd53      */
#define SDIO_WRITE             0x1U    /*!< Write flag for cmd52 and cmd53     */

#define SDIO_BUS_SPEED_SDR12   0x00U   /*!< SDIO bus speed mode SDR12          */
#define SDIO_BUS_SPEED_SDR25   0x02U   /*!< SDIO bus speed mode SDR25          */
#define SDIO_BUS_SPEED_SDR50   0x04U   /*!< SDIO bus speed mode SDR50          */
#define SDIO_BUS_SPEED_DDR50   0x08U   /*!< SDIO bus speed mode DDR50          */

